Revit 2024 API
ParameterTypeId.RbsElecCircuitConnectionTypeParam Property
 "Connection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecCircuitConnectionTypeParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecCircuitConnectionTypeParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecCircuitConnectionTypeParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace